[
    { "phrase": "Yo mama's so fat, when she fell I didn't laugh, but the sidewalk cracked up.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so fat, when she skips a meal, the stock market drops.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so fat, it took me two buses and a train to get to her good side.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so fat, when she goes camping, the bears hide their food.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so fat, if she buys a fur coat, a whole species will become extinct.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so fat, she stepped on a scale and it said: \"To be continued.\"", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so fat, I swerved to miss her in my car and ran out of gas.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so fat, when she wears high heels, she strikes oil.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so fat, she was overthrown by a small militia group, and now she's known as the Republic of Yo Mama.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so fat, when she sits around the house, she SITS AROUND the house.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so fat, her car has stretch marks.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so fat, she can't even jump to a conclusion.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so fat, her blood type is Ragu.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so fat, if she was a Star Wars character, her name would be Admiral Snackbar.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so fat, she brought a spoon to the Super Bowl.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so stupid, she stared at a cup of orange juice for 12 hours because it said \"concentrate.\"", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so stupid when they said it was chilly outside, she grabbed a bowl.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so stupid, she put lipstick on her forehead to make up her mind.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so stupid, when they said, \"Order in the court\", she asked for fries and a shake.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so stupid, she thought a quarterback was a refund.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so stupid, she got hit by a parked car.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so stupid, when I told her that she lost her mind, she went looking for it", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so stupid when thieves broke into her house and stole the TV, she chased after them shouting \"Wait, you forgot the remote!\"", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so stupid, she went to the dentist to get a Bluetooth.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so stupid, she took a ruler to bed to see how long she slept.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so stupid, she got locked in the grocery store and starved to death.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so stupid, when I said, \"Drinks on the house\", she got a ladder.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so stupid, it takes her two hours to watch 60 Minutes.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so stupid, she put airbags on her computer in case it crashed.", "result": { "joke": 1 } },
    { "phrase": "Best yo mama so ugly jokes.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so ugly, she threw a boomerang and it refused to come back.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so old, her social security number is one.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so ugly, she made a blind kid cry.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so ugly, her portraits hang themselves.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so old, she walked out of a museum and the alarm went off.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's teeth are so yellow when she smiles at traffic, it slows down.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's armpits are so hairy, it looks like she's got Buckwheat in a headlock.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so ugly, when she was little, she had to trick-or-treat by phone.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so ugly, her birth certificate is an apology letter.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so ugly, she looked out the window and was arrested for mooning.", "result": { "joke": 1 } },
    { "phrase": "Funniest yo mama jokes of all time", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so poor, the ducks throw bread at her.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so poor, she chases the garbage truck with a grocery list.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's cooking so nasty, she flys got together and fixed the hole in the window screen.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so depressing, blues singers come to visit her when they've got writer's block.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so short, you can see her feet on her driver's license.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so poor, she can't even afford to pay attention.", "result": { "joke": 1 } },
    { "phrase": "Yo mama so big, her belt size is \"equator.\"", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so classless, she's a Marxist utopia.", "result": { "joke": 1 } },
    { "phrase": "Yo mama so short, she went to see Santa and he told her to get back to work.", "result": { "joke": 1 } },
    { "phrase": "Yo mama so scary, the government moved Halloween to her birthday.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so nasty, they used to call them jumpolines 'til yo mama bounced on one.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's teeth so yellow, I can't believe it's not butter.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so poor, Nigerian princes wire her money.", "result": { "joke": 1 } },
    { "phrase": "Yo mama so dumb, she went to the eye doctor to get an iPhone.", "result": { "joke": 1 } },
    { "phrase": "Yo mama's so lazy, she stuck her nose out the window and let the wind blow it.", "result": { "joke": 1 } },
    { "phrase": "ur mom gae", "result": { "joke": 1 } },
    { "phrase": "ur mom gay", "result": { "joke": 1 } },
    { "phrase": "ur mom lesbian", "result": { "joke": 1 } },
    { "phrase": "ur mom", "result": { "joke": 1 } },
    { "phrase": "ur mom is a person", "result": { "joke": 1 } },
    { "phrase": "ur mom is a cow", "result": { "joke": 1 } },
    { "phrase": "ur mom lol", "result": { "joke": 1 } },
    { "phrase": "ur mom!", "result": { "joke": 1 } },
    { "phrase": "ur mom is a", "result": { "joke": 1 } },
    { "phrase": "ur mom is a good cook", "result": { "joke": 0 } },
    { "phrase": "ur mom is a nice person!", "result": { "joke": 0 } },
    { "phrase": "i like ur mom!", "result": { "joke": 0 } },
    { "phrase": "ur mom sounds nice", "result": { "joke": 0 } },
    { "phrase": "your mom is nice!", "result": { "joke": 0 } },
    { "phrase": "your mom is cool!", "result": { "joke": 0 } },
    { "phrase": "ur mom is cool!", "result": { "joke": 0 } },
    { "phrase": "ur mom is really good!", "result": { "joke": 0 } },
    { "phrase": "i wish i had ur mom...", "result": { "joke": 0 } }
]